//--створити масив з:
//    - з 5 числових значень
//- з 5 стічкових значень
//- з 5 значень стрічкового, числового та булевого типу
//- та вивести його в консоль

//-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

/*let arr =[];
arr [0]=89;
arr[1]='afgl'
console.log(arr)*/


//- є масив [2,17,13,6,22,31,45,66,100,-18] :

//1. перебрати його циклом while
let a = [2,17,13,6,22,31,45,66,100,-18];

let i= 0;
while(i<a.length) {
    let ab = a[i];
    console.log(ab);
    i++;
}



//    2. перебрати його циклом for

//let b = [2,17,13,6,22,31,45,66,100,-18];
//for (let i= 0;i<b.length;i++){
   // console.log(b[i]);
//}
//    3. перебрати циклом while та вивести  числа тільки з непарним індексом
//4. перебрати циклом for та вивести  числа тільки з непарним індексом
let c= [2,17,13,6,22,31,45,66,100,-18];
for (let i=0;i<c.length;i++){
    if (i/2===true)
        console.log(c[i])
}
//5. перебрати циклом while та вивести  числа тільки парні  значення
//6. перебрати циклом for та вивести  числа тільки парні  значення
//7. замінити кожне число кратне 3 на слово "okten"
//8. вивести масив в зворотньому порядку.
//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

//- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
//- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
//- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
//- Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

//- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
//- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
//- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
//- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write



//стоврити масив книжок (назва, кількість сторінок, автори , жанри).
//-знайти наібльшу книжку.
//- знайти книжку/ки з найбільшою кількістю жанрів
//- знайти книжку/ки з найдовшою назвою
//- знайти книжку/ки які писали 2 автори
//- знайти книжку/ки які писав 1 автор
